emacs/.minemacs.d/config.el
;;; config.el -*- coding: utf-8-unix; lexical-binding: t; -*-

;; NOTE: This file is generated from "config-literate.org".

;; [[file:../../literate-config.org::*User information][User information:1]]
;; Personal info
(setq user-full-name "Abdelhak Bougouffa"
      user-mail-address (rot13 "nobhtbhssn@srqbencebwrpg.bet"))
;; User information:1 ends here

;; [[file:../../literate-config.org::*Crypto stuff][Crypto stuff:1]]
(setq-default
 ;; Encrypt files to my self by default
 epa-file-encrypt-to '("F808A020A3E1AC37"))
;; Crypto stuff:1 ends here

;; [[file:../../literate-config.org::*Bidirectional settings][Bidirectional settings:1]]
(setq-default
 ;; Better support for files with long lines
 bidi-paragraph-direction 'left-to-right
 ;; Speeds redisplay, may break paranthesis rendering for bidirectional files
 bidi-inhibit-bpa t)
;; Bidirectional settings:1 ends here

;; [[file:../../literate-config.org::*Directories][Directories:1]]
(defvar +biblio-notes-path (expand-file-name "~/Research/bibliography/notes/"))
(defvar +biblio-styles-path (expand-file-name "~/Zotero/styles/"))
(defvar +biblio-storage-path (expand-file-name "~/Zotero/storage/"))
(defvar +biblio-libraries-path (expand-file-name "~/Zotero/library.bib"))

(setq org-directory "~/Dropbox/Org/"
      source-directory "~/Softwares/aur/emacs-git/src/emacs-git/")
;; Directories:1 ends here

;; [[file:../../literate-config.org::*Misc][Misc:1]]
(setq +binary-hexl-enable t
      +binary-objdump-enable t
      browse-url-chromium-program (or (executable-find "brave")
                                      (executable-find "chromium")
                                      (executable-find "chromium-browser"))
      browse-url-chrome-program browse-url-chromium-program)
;; Misc:1 ends here

;; [[file:../../literate-config.org::*Awqat][Awqat:1]]
(+lazy-when! (featurep 'me-lifestyle)
  ;; Calendar settings (from `solar')
  (setq calendar-latitude 48.86
        calendar-longitude 2.35
        calendar-location-name "Paris, FR"
        calendar-time-display-form '(24-hours ":" minutes))

  (awqat-display-prayer-time-mode 1)
  (awqat-set-preset-french-muslims))
;; Awqat:1 ends here

;; [[file:../../literate-config.org::*Projects][Projects:1]]
(+lazy!
 (setq +project-scan-dir-paths
       '("~/Research/papers/"
         "~/Research/workspace/"
         "~/Research/workspace-no/"
         "~/Research/workspace-no/ez-wheel/swd-starter-kit-repo/"
         "~/Projects/foss/packages/"
         "~/Projects/foss/repos/"))

 (+shutup!
  (+project-scan-for-projects)))
;; Projects:1 ends here

;; [[file:../../literate-config.org::*Theme & font][Theme & font:1]]
(setq minemacs-theme 'doom-one-light) ; 'apropospriate-light
;; Theme & font:1 ends here

;; [[file:../../literate-config.org::*Writing mode][Writing mode:1]]
(with-eval-after-load 'me-writing-mode
  (setq +writing-mixed-pitch-enable nil
        +writing-text-scale 2.0))
;; Writing mode:1 ends here

;; [[file:../../literate-config.org::*LSP][LSP:1]]
(with-eval-after-load 'lsp-mode
  (lsp-register-client
   (make-lsp-client
    :new-connection (lsp-tramp-connection "pyls")
    :major-modes '(python-mode python-ts-mode)
    :remote? t
    :server-id 'pyls-remote)))
;; LSP:1 ends here
